read_verilog -sv -formal -overwrite {workspace}/sv/SystemVerilog验证（原书第三版）相关资料/课后题解决方案/risc_spm/Clock_Unit.v
design -reset-vlog; proc;
write_json {workspace}/netlist/Clock_Unit.json