read_verilog -sv -formal -overwrite {workspace}/verilog/CBB/DFF/dff.v
design -reset-vlog; proc;
write_json {workspace}/netlist/Dff.json